Revit 2027 API
GenericZone.LevelOffset Property
 The offset distance from this zone to the associated level.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LevelOffset { get; set; }
Public Property LevelOffset As Double
	Get
	Set
public:
property double LevelOffset {
	double get ();
	void set (double value);
}
member LevelOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace